# 1

# a = input('Введите возраст: ')
# b = input('Введите пол: ')
# c = input('Введите имя: ')
# d = input('Введите город: ')
# e = input('Введите класс обучения: ')
# q = [a, b, c, d, e]
# print(q)

# 2

# x = -3.8
# y = (((5 * x - 3) ** 2)/(7 * x ** 3))/((4 - 2 * x)/(84 + x ** 4))
# print(f'y = {y}')

# x = 6
# y = (((5 * x - 3) ** 2)/(7 * x ** 3))/((4 - 2 * x)/(84 + x ** 4))
# print(f'y = {y}')

# x = 10.5
# y = (((5 * x - 3) ** 2)/(7 * x ** 3))/((4 - 2 * x)/(84 + x ** 4))
# print(f'y = {y}')
