# 1

# #print('Hello, World!')

# #print('Маша + Петя = Любовь')

# #print('х = 3 + 4')

# #x = 3 + 4
# #print (f'x = {x}')

#2

# #х = 'Hello, World!'
# #print(type('x'))

# #х = 3 + 4
# #print(type('x'))

# #х = 3 / 4
# #print(type('x'))

# #х = [1, 2, 5, 10, 100]
# #print(type('x'))

# 3

# # x = 3
# # y = (((x ** 3) ** 0.5))/(x ** 3 + 3/x) * (4 * (x ** 7) - x ** 5) + 80 * ((27 * (x ** 2) + 12 * (x ** 3) - 5 * (x ** 2) + 10)** 0.5)
# # print(f'y = {y}')

# #x = 3
# #y = ((3 % 2) + int(16.7 * 4.32))/(14.5 + (31 % 12) - int(x ** 3.4))
# #print(f'y = {y}')

# 4

# #a = [1, 5, 'Good', 'Bad']
# #print(a)  

# #b = [9, 'Blue', 'Red', 11]
# #print(b)

# #c = str(a[1])
# #print(c + b[3])

# #print(a[2] + b[2])

# #print(a[0] * b[0])

# #print(a[1] ** b[3])

# #print(a + b)

# print('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')

# a = input('Введите недостающее первое слово («покрытая …»): ')
# b = input('Введите недостающую первую букву («кожиц..й»): ')
# c = input('Введите недостающее второе слово («держится на …»): ')
# d = input('Введите недостающую вторую букву («ножк..»): ')
# e = input('Введите недостающее третье слово («затянута …»): ')
# f = input('Введите недостающее четвёртое слово («нижняя …»): ')
# g = input('Введите недостающую третью букву («шляпк..»): ')

# print(f'Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d} . Снизу шляпка затянута {e} плёнкой. Когда её уберёшь, откроется нижняя {f} сторона шляпк{g}.')